const AgeGroups = [
  {
    id: 1,
    code: '1-2.30',
    desc: '۱ ماه و۰ روزگی تا ۲ ماه و ۳۰ روزگی',
    title: 'پرسشنامه ۲ ماهگی',
  },
  {
    id: 2,
    code: '3-4.30',
    desc: '',
    title: 'پرسشنامه ۴ ماهگی',
  },
  {
    id: 3,
    code: '5-6.30',
    desc: '',
    title: 'پرسشنامه ۶ ماهگی',
  },
  {
    id: 4,
    code: '7-8.30',
    desc: '',
    title: 'پرسشنامه ۸ ماهگی',
  },
  {
    id: 5,
    code: '9-9.30',
    desc: '',
    title: 'پرسشنامه ۹ ماهگی',
  },
  {
    id: 6,
    code: '10-10.30',
    desc: '',
    title: 'پرسشنامه ۱۰ ماهگی',
  },

  {
    id: 7,
    code: '11-12.30',
    desc: '',
    title: 'پرسشنامه ۱۲ ماهگی',
  },
  {
    id: 8,
    code: '13-14.30',
    desc: '',
    title: 'پرسشنامه ۱۴ ماهگی',
  },
  {
    id: 9,
    code: '15-16.30',
    desc: '',
    title: 'پرسشنامه ۱۶ ماهگی',
  },
  {
    id: 10,
    code: '17-18.30',
    desc: '',
    title: 'پرسشنامه ۱۸ ماهگی',
  },
  {
    id: 11,
    code: '19-20.30',
    desc: '',
    title: 'پرسشنامه ۲۰ ماهگی',
  },
  {
    id: 12,
    code: '21-22.30',
    desc: '',
    title: 'پرسشنامه ۲۲ ماهگی',
  },
  {
    id: 13,
    code: '23-25.15',
    desc: '',
    title: 'پرسشنامه ۲۴ ماهگی',
  },

  {
    id: 14,
    code: '25.16-28.15',
    desc: '',
    title: 'پرسشنامه ۲۷ ماهگی',
  },
  {
    id: 15,
    code: '28.16-31.15',
    desc: '',
    title: 'پرسشنامه ۳۰ ماهگی',
  },
  {
    id: 16,
    code: '31.16-34.15',
    desc: '',
    title: 'پرسشنامه ۳۳ ماهگی',
  },
  {
    id: 17,
    code: '34.16-38.30',
    desc: '',
    title: 'پرسشنامه ۳۶ ماهگی',
  },
  {
    id: 18,
    code: '39-44.30',
    desc: '',
    title: 'پرسشنامه ۴۲ ماهگی',
  },
  {
    id: 19,
    code: '45-50.30',
    desc: '',
    title: 'پرسشنامه ۴۸ ماهگی',
  },
  {
    id: 20,
    code: '51-56.30',
    desc: '',
    title: 'پرسشنامه ۵۴ ماهگی',
  },
  {
    id: 21,
    code: '57-66',
    desc: '',
    title: 'پرسشنامه ۶۰ ماهگی',
  },
];
export default AgeGroups;
