const ChildInformationFormZero = [
  {
    id: 1,
    question: 'نام و نام خانوادگی کودک',
    type: 'text',
  },
  {
    id: 2,
    question: 'وزن کودک در هنگام تولد',
    type: 'weight',
  },

  {
    id: 3,
    question: ' تاریخ تولد کودک',
    type: 'date',
  },
  {
    id: 4,
    question: '   تعداد هفته تولد زودهنگام کودک',
    type: 'number',
  },
  {
    id: 5,
    question: 'تاریخ تولد مادر',
    type: 'date',
  },
  {
    id: 6,
    question: 'تحصیلات مادر',
    type: 'select',
    items: [
      'کمتر از دیپلم',
      'دیپلم',
      'کاردانی',
      'کارشناسی',
      'کارشناسی ارشد',
      'دکتری',
      'فوق دکتری',
    ],
  },
  {
    id: 7,
    question: 'آیا کودک مراقبینی غیر از پدر و مادر دارد ؟',
    type: 'radio',
    options: ['بله', 'خیر'],
    condition: [
      'پرستار',
      'مادربزرگ',
      ' افراد دیگر',
      'کودک بیش از یک مراقب دارد ',
    ],
  },

  {
    id: 8,
    question:
      '	آیا مراقبان ، هم راستا با روشهای تربیتی و قانون گذاری شما هستند ؟ ',
    type: 'range',
    options: {
      100: 'کاملا موافق',
      75: 'موافق',
      50: 'نسبتا موافق',
      25: 'مخالف',
      0: 'کاملا مخالف',
    },
  },
  {
    id: 9,
    question: ' وزن کودک حین تولد چقدر بوده است',
    type: 'number',
  },
  {
    id: 10,
    question: 'ایا کودک چهار دست و پا و سینه خیز رفته است',
    type: 'radio',
    options: ['بله', 'خیر'],
  },
  {
    id: 11,
    question: 'آیا کودک ارتباط چشمی برقرار میکند؟ ',
    type: 'radio',
    options: ['بله', 'خیر'],
  },
  {
    id: 12,
    question: ' آیا رشد جسمی مطابق با نرم است؟',
    type: 'radio',
    options: ['بله', 'خیر'],
  },
];

const ChildInformationForm = [
  {
    id: 1,
    question: 'نام و نام خانوادگی کودک',
    type: 'text',
  },
  // {
  //   id: 2,
  //   question: 'نام خانوادگی کودک',
  //   type: 'text',
  // },
  {
    id: 2,
    question: 'وزن کودک در هنگام تولد',
    type: 'weight',
  },
  {
    id: 3,
    question: 'روز/ماه/سال تولد کودک',
    type: 'date',
  },
  {
    id: 4,
    question: 'تاریخ تولد مادر',
    type: 'date',
  },
  {
    id: 5,
    question: 'تحصیلات مادر',
    type: 'select',
    items: [
      'کمتر از دیپلم',
      'دیپلم',
      'کاردانی',
      'کارشناسی',
      'کارشناسی ارشد',
      'دکتری',
      'فوق دکتری',
    ],
  },
  {
    id: 6,
    question: 'شغل مادر',
    type: 'text',
  },
  {
    id: 7,
    question: 'تاریخ تولد پدر',
    type: 'date',
  },
  {
    id: 8,
    question: 'تحصیلات پدر',
    type: 'select',
    items: [
      'کمتر از دیپلم',
      'دیپلم',
      'کاردانی',
      'کارشناسی',
      'کارشناسی ارشد',
      'دکتری',
      'فوق دکتری',
    ],
  },
  {
    id: 9,
    question: 'شغل پدر',
    type: 'text',
  },
  {
    id: 10,
    question: 'چند فرزند دارید؟',
    type: 'number',
    // options: [],
    condition: [
      {
        id: 1,
        question: 'فاصله ی سنی فرزندان از یک دیگر چقدر است؟',
        type: 'text',
        options: [],
      },
      {
        id: 2,
        question: 'کودک ثبت نام شده فرزند چندم است؟',
        type: 'text',
      },
    ],
  },

  {
    id: 11,
    question: 'آیا بارداری شما خواسته بوده است؟',
    type: 'radio',
    options: ['بله', 'خیر'],
  },
  {
    id: 12,
    question: 'آیا پیش آمده فرزند شما شاهد مشاجره و نزاع بوده باشد؟',
    type: 'radio',
    options: ['به ندرت', 'گاهی', 'اغلب'],
  },
  {
    id: 13,
    question:
      'مشاجراتی که فرزندتان شاهد بوده معمولا لفظی فیزیکی هر دو نوع بوده است.',
    type: 'radio',
    options: ['لفظی', 'فیزیکی', 'هر دو'],
  },
  {
    id: 14,
    question:
      'مدت زمانی که پدر و مادر با یک دیگر وقت می‌گذرانند برای: تفریح و صمیمیت/مسائل کاری و زندگی روزمره / مسائل تربیتی کودک',
    type: 'text',
  },
  {
    id: 15,
    question: 'کودک رابطه‌ی عاطفی میان دو والد را می‌بیند؟',
    type: 'radio',
    options: ['گاهی', 'به ندرت', 'اغلب'],
  },

  {
    id: 16,
    question: 'آیا با کودک به منظور تامین نیاز به توجه ، بازی می کنید ؟',
    type: 'radio',
    options: ['بله', 'خیر'],
    desc: ' توضیح : تامین توجه، یعنی انجام بازی دلخواه کودک که جنبه ی آموزشی نداشته باشد و کودک از آن لذت ببرد.',
  },
  {
    id: 17,
    question: '   آیا به طور معمول هر روز با کودک بازی می کنید ؟',
    type: 'radio',
    options: ['بله', 'خیر'],
  },
  {
    id: 18,
    question: 'مدت زمان بازی شما با کودک چند ساعت است ؟',
    type: 'radio',
    options: [
      'کمتر از نیم ساعت',
      'یک ساعت ',
      'بیش ازیک ساعت و نیم ( توضیح : مقصود این نیست یک ساعت و نیم بدون وقفه باشد ) ',
    ],
    desc: '     مقصود زمانی است که به بازی اختصاص می دهید ، مقصود زمان رفت و آمد به کلاس ها و ... نیست .   ',
  },
  {
    id: 19,
    question: 'آیا کودک از شما دعوت به بازی می کند ؟',
    type: 'radio',
    options: [
      'همیشه - بالغ بر 50% موارد ',
      'گاهی 50% ',
      'بالغ بر 50% موارد من (والد) فرزندم را به بازی دعوت می کنم. ',
    ],
  },
  {
    id: 20,
    question: ' وقتی کودک دعوت به بازی می کند پاسخ شما چگونه است ؟',
    type: 'radio',
    options: [
      ' معمولا حوصله ندارم – یا کار دارم – و بیشتر پاسخ منفی می دهم.',
      'پیش می آید که با بی حوصلگی قبول می کنم.',
      ' قبول می کنم و بازی را مشروط به انجام کار یا کارهایی، می کنم.',
      ' معمولا قبول می کنم ، تا کارهایی را انجام بدهم شروع بازی به تاخیر می افتد.',
      'معمولا با روی گشاده قبول می کنم ',
    ],
  },
  {
    id: 21,
    question: '  ...فرزندم از بازی با من استقبال ',
    type: 'radio',
    options: ['میکند', 'نمیکند'],
  },
  {
    id: 22,
    question: ' آیا نوع بازی ای که می کنید دلخواه کودک هست ',
    type: 'radio',
    options: ['بله', 'خیر'],
  },
  {
    id: 23,
    question: 'در حین بازی با فرزندم موبایلم را چک می کنم',
    type: 'radio',
    options: ['اغلب', 'گاهی', 'به ندرت'],
  },
  {
    id: 24,
    question: ' با کودکم کم بازی می کنم اما جایگزین دارد',
    type: 'radio',
    options: [
      'با همسالان یا خواهر و برادرش بازی می کند.',
      'با یک بزرگسال معمولا بازی میکند ( مثل عمو، خاله و...)',
      'خودش سرگرم میشود.',
    ],
  },

  {
    id: 25,
    question: 'آیا کودک مراقبینی غیر از پدر و مادر دارد ؟',
    type: 'radio',
    options: ['بله', 'خیر'],
    condition: [
      'پرستار',
      'مادربزرگ',
      ' افراد دیگر',
      'کودک بیش از یک مراقب دارد ',
    ],
  },
  {
    id: 26,
    question:
      '	آیا مراقبان ، هم راستا با روشهای تربیتی و قانون گذاری شما هستند ؟ ',
    type: 'range',
    options: {
      100: 'کاملا موافق',
      75: 'موافق',
      50: 'نسبتا موافق',
      25: 'مخالف',
      0: 'کاملا مخالف',
    },
  },
  {
    id: 27,
    question: 'آیا پدر و مادر در روش های تربیتی خود کاملا با هم هم سو هستند ؟',
    type: 'radio',
    options: ['بله', 'خیر'],
  },
  {
    id: 28,
    question:
      '	آیا پیش می آید در روش های تربیتی، با همسرتان دچار اختلاف های تکرار شونده باشید ؟',
    type: 'radio',
    options: ['بله', 'خیر'],
  },
  {
    id: 29,
    question:
      '	آیا پیش می آید فرزند شما متوجه اختلاف نظر شما ( پدر و مادر ) بشود ؟',
    type: 'radio',
    options: ['بله', 'خیر'],
  },
  {
    id: 30,
    question: 'وقتی یکی از والدین کاری را منع می کند :',
    type: 'radio',
    options: [
      'هر دو والد یکسان رفتار می کنند ',
      'کودک به والد دیگر پناه می برد و به خواسته خود می رسد.',
      '	والد دیگر پا در میانی می کند تا کودک به خواست اش برسد.',
    ],
  },
  {
    id: 31,
    question:
      ' آیا پیش می آید قانون یا محرومیتی را بگذارید و آن را اجرایی نکنید',
    type: 'radio',
    options: [
      'چون دلم برای کودک می سوزد.',
      '	چون خیلی گریه و بی قراری می کند',
      '	ببخشید می گوید و من می بخشم.',
    ],
  },
];

export { ChildInformationFormZero, ChildInformationForm };
